---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropService
source: html/d415b108-1b39-bdc5-d11b-a9ac0b289221.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropService Property

The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation.
 To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropServer .

## Syntax (C#)
```csharp
public static ExternalServiceId PipeFittingAndAccessoryPressureDropService { get; }
```